Repository: YolfTypo3/SavLibraryMvc
Catalog: Resources/Private/Language/*.locallang.xlf
Languages: fr

# button.backwardFirstPage
source: First
fr: Premier

# button.backwardPage
source: Previous
fr: Précédent

# button.close
source: Close
fr: Sortir

# button.delete
source: Delete
fr: Supprimer

# button.deleteItem
source: Delete Item
fr: Supprimer l'item

# button.down
source: Down
fr: Descendre

# button.edit
source: Edit
fr: Editer

# button.enterEditMode
source: Enter in the edit mode
fr: Entrer en mode édition

# button.export
source: Export data
fr: Exporter

# button.exportExecute
source: Execute export data
fr: Exécuter l'exportation

# button.exportLoad
source: Load export configuration
fr: Charger la configuration

# button.forwardPage
source: Next
fr: Suivant

# button.forwardLastPage
source: Last
fr: Dernier

# button.leaveEditMode
source: Leave the edit mode
fr: Quitter le mode édition

# button.new
source: New
fr: Nouveau

# button.orderAsc
source: Sort by ascending order
fr: Trier par ordre croissant

# button.orderDesc
source: Sort by descending order
fr: Trier par ordre décroissant

# button.save
source: Save
fr: Enregistrer

# button.saveandclose
source: Save and close
fr: Enregistrer et sortir

# button.saveandnew
source: Save and new
fr: Enregistrer et nouveau

# button.saveandshow
source: Save and show
fr: Enregistrer et voir

# button.show
source: Show
fr: Voir

# button.up
source: Up
fr: Monter

# error.failureInExec
source: Error: failure in exec command.
fr: Erreur : la commande exec ne s'est pas terminée correctement.

# error.failureInWritingTemporaryFile
source: Error: %s.
fr: Erreur: %s.

# error.failureInYamlExportVariables
source: The export variables contain error. Check Yaml syntax.
fr: Les variables d'exportation contiennent des erreurs. Vérifier la syntaxe Yaml.

# error.fileDoesNotExist
source: File does not exist: %s.
fr: Fichier inexistant : %s.

# error.graphExtensionNotLoaded
source: Extension sav_charts must be loaded to use graphs.
fr: L'extension sav_charts doit être chargée pour utiliser les graphes.

# error.graphTemplateNotSet
source: A graph template must be set using the attribute "graphTemplate".
fr: Un gabarit doit être défini en utilisant l'attribut "graphTemplate".

# error.graphTemplateUnknown
source: The graph template "%s" is unknown.
fr: Le gabarit "%s" est inconnu.

# error.incorrectQuery
source: Error in the query associated with the view "%s".
fr: Erreur dans la requête associée à la vue "%s".

# error.incorrectQueryInReqValue
source: Error in the query associated with the property "reqValue" in the field "%s".
fr: Erreur dans requête associée à la propriété "reqValue" dans le champ "%s".

# error.incorrectXmlProducedFile
source: The XML file produced during the export contains syntax errors. It may come from your template file "%s".
fr: Le fichier XML produit lors de l'exportation contient des erreurs de syntaxe. Cela peut venir de gabarit "%s".

# error.incorrectXsltFile
source: The XSL transformation file contains syntax errors: %s.
fr: Le fichier de transformation XSL contient des erreurs de syntaxe : %s.

# error.incorrectXsltResult
source: The XSL transformation failed.
fr: La transformation XSL a échoué.

# error.missingLabel
source: Missing label: %s.
fr: Label manquant : %s.

# error.notAllowedToUseComplexExecCommand
source: Only COPY and RENAME commands are allowed.
fr: Seules les commandes COPY et RENAME sont autorisées.

# error.notAllowedToUseQueryViewHelper
source: You are not allowed to use the "query ViewHelper".
fr: L'utilisation du "ViewHelper query" n'est pas autorisée.

# error.unknownTemplateFile
source: The following template file is unknown: %s.
fr: Le gabarit suivant est inconnu : %s.

# error.unknownGetMethod
source: The getter associated with the following field is unknown: %s.
fr: Le "getter" associé au champ suivant est inconnu: %s.

# error.xmlError
source: Error "%s" in line %d.
fr: Erreur "%s" à la ligne %d.

# error.xmlErrorFile
source: Click here
fr: Cliquer ici

# extensionFlexform.addFragment
source: Add a fragment(#content id) to links
fr: Ajouter un fragment (#content id) aux liens

# extensionFlexform.allowExec
source: Allow the use of the exec function in export
fr: Autoriser l'exécution de commandes dans l'exportation des données

# extensionFlexform.allowedGroups
source: Allowed groups
fr: Groupes autorisés

# extensionFlexform.allowQueryProperty
source: Allow the use of the "query" property
fr: Autoriser l'utilisation de la propriété "query"

# extensionFlexform.deleteButtonOnlyForCruser
source: Add a "delete" button only for records created by the user
fr: Ajouter un bouton "Supprimer" pour les enregistrements créés par l'utilisateur

# extensionFlexform.formId
source: Select form
fr: Choisir un formulaire

# extensionFlexform.inputAdminField
source: Input Admin Field
fr: Champ Admin

# extensionFlexform.inputApplyLimit
source: Apply date limit to
fr: Appliquer la limite de date à

# extensionFlexform.inputApplyLimit.I.0
source: Nobody
fr: Personne

# extensionFlexform.inputApplyLimit.I.1
source: All
fr: Tous

# extensionFlexform.inputApplyLimit.I.2
source: "Admin plus" users
fr: Utilisateurs "Admin plus"

# extensionFlexform.inputApplyLimit.I.3
source: All excluding "Super Admin"
fr: Tous sauf les utilisateurs "Super Admin"

# extensionFlexform.inputEndDate
source: Input end date
fr: Date de fin de saisie

# extensionFlexform.inputIsAllowed
source: Allow authenticated FE users to input data
fr: Autoriser les utilisateurs authentifiés à entrer des données

# extensionFlexform.inputStartDate
source: Input start date
fr: Date de début de saisie

# extensionFlexform.help
source: Help
fr: Aide

# extensionFlexform.maxItems
source: Max number of items
fr: Nombre maximal d'éléments affichés

# extensionFlexform.noDeleteButton
source: No "delete" button
fr: Pas de bouton "Supprimer"

# extensionFlexform.noEditButton
source: No "edit" button
fr: Pas de bouton "Editer"

# extensionFlexform.noFilterShowAll
source: Show all if no filter
fr: Tout montrer si pas de filtre

# extensionFlexform.noNewButton
source: No "new" button
fr: Pas de bouton "Nouveau"

# extensionFlexform.permanentFilter
source: Permanent filter
fr: Filtre permanent

# extensionFlexform.sheetTitle.sAdvanced
source: Advanced
fr: Avancées

# extensionFlexform.sheetTitle.sInput
source: Input controls
fr: Options de saisie

# extensionFlexform.showNoAvailableInformation
source: If no information available
fr: Si aucune information disponible

# extensionFlexform.showNoAvailableInformation.I.0
source: Show a message
fr: Afficher un message

# extensionFlexform.showNoAvailableInformation.I.1
source: Do not show a message
fr: Ne pas afficher de message

# extensionFlexform.showNoAvailableInformation.I.2
source: Hide the extension
fr: Ne pas afficher l'extension

# fatal.notAuthenticated
source: You must be authenticated to save, edit, delete data.
fr: Vous devez être authentifié poure enregistrer, éditer ou supprimer vos données.

# fatal.notAllowedToExportData
source: You are not allowed to export data.
fr: L'exportation des données n'est pas autorisée

# icon.required
source: Required field
fr: Champ requis

# itemviewer.checkboxSelected
source: Selected
fr: Sélectionné

# itemviewer.checkboxNotSelected
source: Not selected
fr: Non sélectionné

# itemviewer.configurationGroup
source: Group
fr: Groupe

# itemviewer.no
source: No
fr: Non

# itemviewer.radioButtonSelected
source: Selected
fr: Sélectionné

# itemviewer.radioButtonNotSelected
source: Not selected
fr: Non sélectionné

# itemviewer.yes
source: Yes
fr: Oui

# general.new
source: New
fr: Nouveau

# message.noAvailableInformation
source: No available information
fr: Aucune information disponible

# tx_savlibrarymvc_domain_model_export.name
source: Name
fr: Nom

# tx_savlibrarymvc_domain_model_export.templateFile
source: Template file
fr: Gabarit

# tx_savlibrarymvc_domain_model_export.xsltFile
source: XSLT file
fr: Fichier XSLT

# upload.error.150530345
source: Maximum file size exceeded.
fr: Taille maximum dépassée.

# upload.error.150530346
source: Upload failed. The file was only partially uploaded, please try again.
fr: Le téléchargement a échoué. Le fichier a été partiellement chargé, essayez à nouveau.

# upload.error.150530347
source: No file was uploaded.
fr: Aucun fichier téléchargé.

# upload.error.150530348
source: Upload failed.
fr: Echec du téléchargement.

# warning.delete
source: Are you sure you want to delete this record?
fr: Etes-vous sûr de vouloir supprimer cet enregistrement ?

# warning.noRecord
source: No record returned.
fr: Aucun enregistrement retourné.

# warning.save
source: Save this record?
fr: Sauvegarder cet enregistrement ?
